РазработкаОУМобильная/src/Catalogs/СК_ТипыРазмеров/СК_ТипыРазмеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_ТипыРазмеров</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.СК_ГруппыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСечения</name>
    <type>
      <types>CatalogRef.СК_ФормыСечения</types>
    </type>
  </attributes>
  <attributes>
    <name>Мерность</name>
    <type>
      <types>CatalogRef.СК_Мерность</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаВеса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРазмераОпределяющийВес</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРазмеров</name>
    <attributes>
      <name>ВидРазмера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтРодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Соединитель</name>
      <type>
        <types>CatalogRef.СК_СоединителиРазмеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерРазмера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерРазмераВОтчетах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеОсновной</name>
      <comment>Не указывается в представлении значения размера</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стандарты</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.СК_НДНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/СК_ТипыРазмеров/ObjectModule.bsl
Функция ЕстьПовторяющиесяЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТипыРазмеров.Ссылка
	               |ИЗ
	               |	Справочник.СК_ТипыРазмеров КАК СК_ТипыРазмеров
	               |ГДЕ
	               |	СК_ТипыРазмеров.ГруппаПродукции = &ГруппаПродукции
	               |	И СК_ТипыРазмеров.ФормаСечения = &ФормаСечения
	               |	И СК_ТипыРазмеров.Мерность = &Мерность
	               |	И СК_ТипыРазмеров.Ссылка <> &Ссылка
	               |	И (НЕ СК_ТипыРазмеров.ПометкаУдаления)";
					   
	Запрос.УстановитьПараметр("ГруппаПродукции",ГруппаПродукции);
    Запрос.УстановитьПараметр("ФормаСечения",ФормаСечения);
	Запрос.УстановитьПараметр("Мерность",Мерность);
    Запрос.УстановитьПараметр("Ссылка",Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	ИначеЕсли Стандарты.Количество() > 0 Тогда 
		// Проверим есть ли типы размеров с такими стандартами
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СК_ТипыРазмеровСтандарты.Ссылка КАК ТипРазмера,
		|	СК_ТипыРазмеровСтандарты.Стандарт КАК Стандарт
		|ИЗ
		|	Справочник.СК_ТипыРазмеров.Стандарты КАК СК_ТипыРазмеровСтандарты
		|ГДЕ
		|	СК_ТипыРазмеровСтандарты.Ссылка В(&СписокТиповРазмера)
		|	И СК_ТипыРазмеровСтандарты.Стандарт В(&СписокСтандартов)";
		
		Запрос.УстановитьПараметр("СписокТиповРазмера", РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
		Запрос.УстановитьПараметр("СписокСтандартов", Стандарты.ВыгрузитьКолонку("Стандарт"));
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Флаг = Ложь;
		
		Пока Выборка.Следующий() Цикл
			Флаг = Истина;
			Сообщить("Стандарт " + Выборка.Стандарт + " указан в " + Выборка.ТипРазмера);
		КонецЦикла;
		Возврат Флаг;
		 
	Иначе
		Сообщить("Есть типы размеров с аналогичными параметрами.");
		Возврат Истина
	КонецЕсли; 
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = истина Тогда
		Возврат;
	КонецЕсли; 
	
	//проверка на ввод повторяюейся записи
	Если ЕстьПовторяющиесяЗаписи() Тогда
		//есть аналогичная запись
		Отказ = Истина;
	КонецЕсли;
		
	//Проверка на ввод пустой строки
	Если ГруппаПродукции.Пустая() Тогда
		Сообщить("Не заполнена группа продукции.");
		Отказ=Истина;
	КонецЕсли;

КонецПроцедуры
